## Importing Libraries

In [30]:
import pandas as pd
import scipy.stats as stats
import numpy as np

## import and read data

In [31]:
data=pd.read_csv('Sales_data_zone_wise.csv')
data.head()

       Month  Zone - A  Zone - B  Zone - C  Zone - D
0  Month - 1   1483525   1748451   1523308   2267260
1  Month - 2   1238428   1707421   2212113   1994341
2  Month - 3   1860771   2091194   1282374   1241600
3  Month - 4   1871571   1759617   2290580   2252681
4  Month - 5   1244922   1606010   1818334   1326062

In [32]:
data.isna().sum() #checking for null values

Month       0
Zone - A    0
Zone - B    0
Zone - C    0
Zone - D    0
dtype: int64

In [33]:
data.describe() # checking statics of the data

           Zone - A      Zone - B      Zone - C      Zone - D
count  2.900000e+01  2.900000e+01  2.900000e+01  2.900000e+01
mean   1.540493e+06  1.755560e+06  1.772871e+06  1.842927e+06
std    2.619401e+05  1.683899e+05  3.331937e+05  3.750165e+05
min    1.128185e+06  1.527574e+06  1.237722e+06  1.234311e+06
25%    1.305972e+06  1.606010e+06  1.523308e+06  1.520406e+06
50%    1.534390e+06  1.740365e+06  1.767047e+06  1.854412e+06
75%    1.820196e+06  1.875658e+06  2.098463e+06  2.180416e+06
max    2.004480e+06  2.091194e+06  2.290580e+06  2.364132e+06

### Total sales of each zone per month

In [34]:
total_sales_per_month=pd.DataFrame(data=data.sum(axis=1),columns=['Total Sales'])
total_sales_per_month.index=data['Month']
total_sales_per_month

            Total Sales
Month
Month - 1       7022544
Month - 2       7152303
Month - 3       6475939
Month - 4       8174449
Month - 5       5995328
Month - 6       7151387
Month - 7       7287108
Month - 8       7816299
Month - 9       6703395
Month - 10      7128210
Month - 11      7032783
Month - 12      6111084
Month - 13      5925424
Month - 14      7155515
Month - 15      5934156
Month - 16      6506659
Month - 17      7149383
Month - 18      7083490
Month - 19      6971953
Month - 20      7124599
Month - 21      7389597
Month - 22      7560001
Month - 23      6687919
Month - 24      7784747
Month - 25      6095918
Month - 26      6512360
Month - 27      6267918
Month - 28      7470920
Month - 29      6772277

### Mean sales per zone

In [35]:
mean_sales_zone=pd.DataFrame(data=np.round(data.mean()),columns=['Mean Sales'])
mean_sales_zone

          Mean Sales
Zone - A   1540493.0
Zone - B   1755560.0
Zone - C   1772871.0
Zone - D   1842927.0

### Company wants to check whether all the zones generate the same amount of sales

## ANNOVA

### H0 : All the zones generate the same mean sales amount
### H1 :Atleast one of the zones have different mean sales amount

In [36]:
fvalue,pvalue=stats.f_oneway(data['Zone - A'],data['Zone - B'],data['Zone - C'],data['Zone - D'])

In [37]:
fvalue,pvalue

(5.672056106843581, 0.0011827601694503335)

#### Since P value is less than 0.05 we can reject the null hypothesis,so atleast one of the zone have different mean sales amount